# Brews
brew "bat"
brew "curl"
brew "fish"
brew "git"
brew "gh"
brew "gradle"
brew "htop"
brew "jq"
brew "llvm"
brew "mas"
brew "mold"
brew "neovim"
brew "nmap"
brew "ripgrep"
brew "rust-analyzer"
brew "rustup-init"
brew "shellcheck"
brew "starship"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"

# Casks
tap "homebrew/cask"
cask "1password"
cask "alfred"
cask "caffeine"
cask "calibre"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "kindle"
cask "kitty"
cask "protonvpn"
cask "signal"
cask "slack"
cask "spotify"
cask "transmission"
cask "vlc"

# Fonts
tap "homebrew/cask-fonts"
cask "font-fontawesome"
cask "font-fira-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"

# App Store
mas "Bear", id: 1091189122
mas "GoodNotes", id: 1444383602
mas "Microsoft To Do", id: 1274495053
mas "WhatsApp", id: 1147396723
mas "WiFi Explorer", id: 494803304
mas "Xcode", id: 497799835

# mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
